## 数据清洗

### Agenda

- 缺失值处理
    - 检查缺失值
    - 删除缺失值
    - 替换缺失值
- 重复值处理
- 字符处理

In [2]:
import pandas as pd
import numpy as np

### 缺失值处理

在一些场景，源数据的缺失（空值）对于分析来说是干扰项，需要系统的处理。

#### 检查缺失值

Pandas提供了isna()和notna()函数来检查缺失值

In [3]:
# 创建测试数据
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f',
'h'],columns=['one', 'two', 'three'])

df1 = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

df1.loc[1:2, 'one'] = 1

df1

        one       two     three
a  0.952290 -2.832590  0.220620
b  1.000000       NaN       NaN
c -0.922034  1.060092  0.316166
d       NaN       NaN       NaN
e -0.360183 -2.768310  0.354230
f  1.573298 -0.235297 -1.269582
g       NaN       NaN       NaN
h  0.444387 -0.079079 -2.525243

In [4]:
df1['one'].isna()

a    False
b    False
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [5]:
df1['one'].notna()

a     True
b     True
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

#### 删除缺失值

删除函数缺失的值可以使用dropna函数，默认在行上应用，这意味着如果行内的任何值是NA，那么整个行被排除。

In [6]:
df1.dropna()

        one       two     three
a  0.952290 -2.832590  0.220620
c -0.922034  1.060092  0.316166
e -0.360183 -2.768310  0.354230
f  1.573298 -0.235297 -1.269582
h  0.444387 -0.079079 -2.525243

可以设置subset参数，例如dropna(subset = ['one'])，来指定当一行中的one字段为空时，才会被删除。

In [7]:
df1.dropna(subset = ['one'])

        one       two     three
a  0.952290 -2.832590  0.220620
b  1.000000       NaN       NaN
c -0.922034  1.060092  0.316166
e -0.360183 -2.768310  0.354230
f  1.573298 -0.235297 -1.269582
h  0.444387 -0.079079 -2.525243

#### 替换缺失值

有些时候，必须用一些具体的值替换缺失值，可以使用fillna()函数。

In [8]:
# 用固定值替换空值
df1.fillna(5)

        one       two     three
a  0.952290 -2.832590  0.220620
b  1.000000  5.000000  5.000000
c -0.922034  1.060092  0.316166
d  5.000000  5.000000  5.000000
e -0.360183 -2.768310  0.354230
f  1.573298 -0.235297 -1.269582
g  5.000000  5.000000  5.000000
h  0.444387 -0.079079 -2.525243

In [9]:
# 用均值替换空值
df1['one'].fillna(df1['one'].mean())

a    0.952290
b    1.000000
c   -0.922034
d    0.447960
e   -0.360183
f    1.573298
g    0.447960
h    0.444387
Name: one, dtype: float64

### 重复值处理

主要使用**drop_duplicates**函数处理重复的数据

In [10]:
# 创建测试数据
df2 = df1.fillna(5)
df2

        one       two     three
a  0.952290 -2.832590  0.220620
b  1.000000  5.000000  5.000000
c -0.922034  1.060092  0.316166
d  5.000000  5.000000  5.000000
e -0.360183 -2.768310  0.354230
f  1.573298 -0.235297 -1.269582
g  5.000000  5.000000  5.000000
h  0.444387 -0.079079 -2.525243

**drop_duplicates**方法默认会删掉完全重复的行

In [11]:
df2.drop_duplicates()

        one       two     three
a  0.952290 -2.832590  0.220620
b  1.000000  5.000000  5.000000
c -0.922034  1.060092  0.316166
d  5.000000  5.000000  5.000000
e -0.360183 -2.768310  0.354230
f  1.573298 -0.235297 -1.269582
h  0.444387 -0.079079 -2.525243

指定subset参数来删除指定列重复的数据

In [12]:
df2.drop_duplicates(subset = ['two'])

        one       two     three
a  0.952290 -2.832590  0.220620
b  1.000000  5.000000  5.000000
c -0.922034  1.060092  0.316166
e -0.360183 -2.768310  0.354230
f  1.573298 -0.235297 -1.269582
h  0.444387 -0.079079 -2.525243

不输入keep值时，系统默认会给keep赋值为first。设置keep值等于last，保留最后一行数据。

In [13]:
df2.drop_duplicates(subset = ['two'], keep = 'last')

        one       two     three
a  0.952290 -2.832590  0.220620
c -0.922034  1.060092  0.316166
e -0.360183 -2.768310  0.354230
f  1.573298 -0.235297 -1.269582
g  5.000000  5.000000  5.000000
h  0.444387 -0.079079 -2.525243

### 字符处理

字符串类型是最常用的格式之一，Pandas中字符串的操作和原生字符串操作几乎一模一样，唯一不同的是需要在操作前加上".str"。

In [24]:
# 创建测试数据
df1['four'] = ['A', ' b ', 'c#', 'd', 'e', 'f', 'g', 'h']
df1

        one       two     three four
a  0.952290 -2.832590  0.220620    A
b  1.000000       NaN       NaN   b
c -0.922034  1.060092  0.316166   c#
d       NaN       NaN       NaN    d
e -0.360183 -2.768310  0.354230    e
f  1.573298 -0.235297 -1.269582    f
g       NaN       NaN       NaN    g
h  0.444387 -0.079079 -2.525243    h

#### 字符替换

In [25]:
# 替换掉#字符
df1['four'] = df1['four'].str.replace('#', '')
df1

        one       two     three four
a  0.952290 -2.832590  0.220620    A
b  1.000000       NaN       NaN   b
c -0.922034  1.060092  0.316166    c
d       NaN       NaN       NaN    d
e -0.360183 -2.768310  0.354230    e
f  1.573298 -0.235297 -1.269582    f
g       NaN       NaN       NaN    g
h  0.444387 -0.079079 -2.525243    h

#### 去除空格

In [ ]:
# 查看字符长度
df1['four'].str.len()

In [28]:
df1['four'] = df1['four'].str.strip()

df1['four'].str.len()

a    1
b    1
c    1
d    1
e    1
f    1
g    1
h    1
Name: four, dtype: int64

#### 大小写转换

In [30]:
df1['four'] = df1['four'].str.lower()
df1

        one       two     three four
a  0.952290 -2.832590  0.220620    a
b  1.000000       NaN       NaN    b
c -0.922034  1.060092  0.316166    c
d       NaN       NaN       NaN    d
e -0.360183 -2.768310  0.354230    e
f  1.573298 -0.235297 -1.269582    f
g       NaN       NaN       NaN    g
h  0.444387 -0.079079 -2.525243    h